; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 11135)
	(= (fuel plane1) 1592)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city2)
	(= (capacity plane2) 3001)
	(= (fuel plane2) 869)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city5)
	(= (capacity plane3) 5393)
	(= (fuel plane3) 381)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city6)
	(= (capacity plane4) 9179)
	(= (fuel plane4) 2238)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 11)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at plane5 city3)
	(= (capacity plane5) 11288)
	(= (fuel plane5) 4295)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 17)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 10)
	(at person1 city2)
	(at person2 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 611)
	(= (distance city0 city2) 830)
	(= (distance city0 city3) 570)
	(= (distance city0 city4) 757)
	(= (distance city0 city5) 504)
	(= (distance city0 city6) 754)
	(= (distance city0 city7) 787)
	(= (distance city0 city8) 799)
	(= (distance city1 city0) 611)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 509)
	(= (distance city1 city3) 993)
	(= (distance city1 city4) 629)
	(= (distance city1 city5) 993)
	(= (distance city1 city6) 522)
	(= (distance city1 city7) 504)
	(= (distance city1 city8) 660)
	(= (distance city2 city0) 830)
	(= (distance city2 city1) 509)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 985)
	(= (distance city2 city4) 580)
	(= (distance city2 city5) 948)
	(= (distance city2 city6) 868)
	(= (distance city2 city7) 734)
	(= (distance city2 city8) 895)
	(= (distance city3 city0) 570)
	(= (distance city3 city1) 993)
	(= (distance city3 city2) 985)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 915)
	(= (distance city3 city5) 517)
	(= (distance city3 city6) 706)
	(= (distance city3 city7) 587)
	(= (distance city3 city8) 565)
	(= (distance city4 city0) 757)
	(= (distance city4 city1) 629)
	(= (distance city4 city2) 580)
	(= (distance city4 city3) 915)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 728)
	(= (distance city4 city6) 764)
	(= (distance city4 city7) 509)
	(= (distance city4 city8) 798)
	(= (distance city5 city0) 504)
	(= (distance city5 city1) 993)
	(= (distance city5 city2) 948)
	(= (distance city5 city3) 517)
	(= (distance city5 city4) 728)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 603)
	(= (distance city5 city7) 620)
	(= (distance city5 city8) 629)
	(= (distance city6 city0) 754)
	(= (distance city6 city1) 522)
	(= (distance city6 city2) 868)
	(= (distance city6 city3) 706)
	(= (distance city6 city4) 764)
	(= (distance city6 city5) 603)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 673)
	(= (distance city6 city8) 878)
	(= (distance city7 city0) 787)
	(= (distance city7 city1) 504)
	(= (distance city7 city2) 734)
	(= (distance city7 city3) 587)
	(= (distance city7 city4) 509)
	(= (distance city7 city5) 620)
	(= (distance city7 city6) 673)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 633)
	(= (distance city8 city0) 799)
	(= (distance city8 city1) 660)
	(= (distance city8 city2) 895)
	(= (distance city8 city3) 565)
	(= (distance city8 city4) 798)
	(= (distance city8 city5) 629)
	(= (distance city8 city6) 878)
	(= (distance city8 city7) 633)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city0)
	(at plane5 city0)
	(at person1 city6)
	(at person2 city8)
	))

(:metric minimize (+ (* 5 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (fly plane5 city3 city0)
   deleted: (at plane5 city3)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 0 to 2850, (fuel plane5) from 4295 to 1445
   goals met: 1 of 4
2. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 4
3. (board person2 plane1 city7)
   deleted: (at person2 city7)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 4
4. (refuel plane1 city7)
   changed: (fuel plane1) from 1592 to 11135
   goals met: 1 of 4
5. (fly plane1 city7 city8)
   deleted: (at plane1 city7)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 2850 to 6015, (fuel plane1) from 11135 to 7970
   goals met: 1 of 4
6. (debark person2 plane1 city8)
   deleted: (in person2 plane1)
   added: (at person2 city8)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 4
7. (fly plane2 city2 city6)
   deleted: (at plane2 city2)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 6015 to 6883, (fuel plane2) from 869 to 1
   goals met: 2 of 4
8. (debark person1 plane2 city6)
   deleted: (in person1 plane2)
   added: (at person1 city6)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 4
9. (refuel plane2 city6)
   changed: (fuel plane2) from 1 to 3001
   goals met: 3 of 4
10. (fly plane2 city6 city0)
   deleted: (at plane2 city6)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 6883 to 7637, (fuel plane2) from 3001 to 2247
   goals met: 4 of 4
